# language: ru
Функционал: навигация 

Сценарий: 5 задание
    Тогда Открыть страницу получения ипотеки
    Тогда Переключиться на вкладку 'Приобретение'
    Тогда Переключиться на программу 'Семейная ипотека'
    Тогда В блоке расчета ежемесячного платежа проверить значение ставки по программе 'Семейная ипотека'
    Тогда Переключиться на вкладку 'Рефинансирование'
    Тогда Переключиться на программу 'Рефинансирование. Семейная ипотека'
    Тогда В блоке расчета ежемесячного платежа проверить значение ставки по программе 'Рефинансирование. Семейная ипотека'

